# შექმენით სია, ამ სიაში ჩაწერეთ სხვადასხვა ციფრები 
# (1, 2, 3, 4, ასე არა, რამე მაგ: 45, 23, 87, 55,) 
# და გამოიტანეთ ამ სიაში ყველა რიცხვის ჯამი, ასევე 
# ამავე სიიდან უნდა დაპრინტოთ ყველა რიცხვი ცალ ცალკე,
# და მიუწეროთ ლუწია თუ კენტი.
#--------------------------------------------------------------------#

numbers = [21,22,41,42,51,52,61,62,71,72]


total = sum(numbers)


print("ყველა რიცხვის ჯამი:", total)


for num in numbers:
    if num % 2 == 0:
        print("ლუწი რიცხვი:", num)
    else:
        print("კენტი რიცხვი:", num)

#--------------------------------------------------------------------#