#--------------------------------------------------------------------#
#1)მომხმარებელს კითხეთ თავისი და მამამისის ასაკი,
#დაუპრინტეთ ყოველ წელს რამდენჯერ უფროსი იქნება მამამისი მასზე.
#--------------------------------------------------------------------#

your_age = int(input("Enter your age: "))
your_fathers_age = int(input("Enter your Father age: "))
year = int(input( "Enter year: "))


for i in range(20):
    print("in " + str(year + i)+ " year difference will be " + str((your_fathers_age + i) / (your_age + i)) + " years")

#--------------------------------------------------------------------#
#2)0იდან 30ის ფარგლებში დაპრინტეთ ყველა ლუწი და კენტი რიცხვი,
#მიუწერეთ გვერდზე კენტია თუ ლუწი.
#--------------------------------------------------------------------#  

even = 2
odd = 1

while even <= 30:
    print(str(odd) + " is odd")
    print(str(even) + " is even")
    even = even + 2
    odd = odd + 2

#--------------------------------------------------------------------#