# ბილეთი ღირს 25 ლარი,
# მაგრამ ბავშვებისთვის უფასოა,
# გვყავს 13 ადამიანი, აქედან 10 დიდი და 3 ბავშვი, 
# გამოთვალეთ ჯამში რამდენი ლარი დასჭირდებათ 

#--------------------------------------------------------------------#

ticket_price = 25

adults = 10
children = 3

if children > 0:
    total_cost = (adults * ticket_price) + (children * 0)
else:
    total_cost = 0

print(total_cost)


#--------------------------------------------------------------------#

# მომხმარებელს შემოატანინეთ სახელი,
# და დაპრინტეთ ეს სახელი იმდენჯერ, რამდენი ასოც არის სახელში.

#--------------------------------------------------------------------#

name = input("Whats your name: ")
len_name = len(name)

print(len_name * name)

#--------------------------------------------------------------------#

# GOA ში ყოველ შემოყვანილ ადამიანზე გეძლევა 100ლ.
# მომხმარებელს შემოატანინეთ თუ რამდენი ადამიანი შემოიყვანა ხოლო თითო შემოყვანილ ადამიანზე დაერიცხოს 100ლ
# 1) რამდენი დაგერიცხება თუ შემოიყვან 10 ბავშვს?  15 ბავშვს?
# 2) რამდენი დაგერიცხება თუ შემოიყვან 100 ბავშვს გამოკლებული 37 დამატებული 13 გაყოფილი 10 და გამრავებული 264 ზე

#--------------------------------------------------------------------#

person = input("People joined by you: ")
print("პირველი დავალების პასუხი")
print(int(person) * 100)

#--------------------------------------------------------------------#

print("მეორე დავალების პასუხი")

print(10 * 100)
print(15 * 100)

#--------------------------------------------------------------------#

print("მესამე დავალების პასუხი")

print(100 - 37 + 13 / 10 * 264)

#--------------------------------------------------------------------#

# დაპრინტეთ hello world (ოღონდ არა ასე print("hello world")  )

#--------------------------------------------------------------------#

hello_world = "hello world"
print(hello_world)

#--------------------------------------------------------------------#