#--------------------------------------------------------------------#

# დავალება 1
# შექმენით სია სადაც გადასცემთ რაზმის ლიდერების სახელს და გვარს 
# ელემენტებად და გამოიტანთ თქვენი რაზმის ლიდერის სახელს

#--------------------------------------------------------------------#

              #0         #1        #2           #3
leaders = ["molodini","janeza","tyeshela","filishvili"]
print(leaders[0]) # molodini

#--------------------------------------------------------------------#

my_list = [
"გურიკო","თინათინ ზუზაძე","ლუკას ვიშტეკალიუ","გიორგი ლობჟანიძე"
,"ლუკა ათაბეგაშვილი","გიო აბულაძე,","თეკლა პაპავა","რეზი ნეფარიძე"
,"დავით ჭილაშვილი","გიო კაციტაძე","მირიან გელაშვილი","რატი მურღულია"
,"ბექა გიორგობიანი","ნინო სოლომონია","ბექა ბერაშვილი","ნინი გოგლიჩაძე"
,"გიორგი ჩხეტიანი","თემო ლაბაძე","გიორგი მგელაძე","დემური სოლომნიშვილი"
,"დემეტრე ხარატიშვილი","დავითი დემურაძე","სალომე მილაძე"
]

print(my_list[8:13])

#--------------------------------------------------------------------#

#შექმენით სია სადაც იქნება რამდენიმე ხილის სახელი და 1 ბოსტნეული, 
#თქვენ უნდა შეცვალოთ ეს 1 ბოსტნეული სხვა რაიმე ხილით და დაპრინტოთ სია

#--------------------------------------------------------------------#

fruit_list = ["pear", "pineapple", "potato", "peach", "watermelon"]
fruit_list[2] = "apple"
print(fruit_list)

#--------------------------------------------------------------------#
#quiz5 ჩათვლით სოლოლერნი
#--------------------------------------------------------------------#